Revit 2026 API

# PlasticVinylPlasticvinylApplication Property

---

The property labeled "Finish" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylApplication { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylApplication As String
	Get
```
```cpp
public:
static property String^ PlasticvinylApplication {
	String^ get ();
}
```
```fsharp
static member PlasticvinylApplication : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylApplicationType".

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace